{
  "homepage": "https://github.com/northwesttrees-gaming/PortalGates",
  "1.19.2": {
    "1.4.0": "Ported Portal Gates to Minecraft 1.19.2",
    "1.5.0": "Added Panic Button Recipe\n\nAdded Forge Gate Recipe\n\nChanged math for forge gate resource cost\n\nFixed Panic Button not working",
    "1.6.0": "Added Anchor Essence\n\nAdded Advancements for Panic Button, Forge Gate, Item Teleporter, Obsidian Anchor, and Anchor Essence.\n\nAdded Item Teleporter\n\nAdded Obsidian Anchor\n\nAdded item tags for new items used in the latest recipes.\n\nAdded tags for cross-mod support for the past two updates.\n\nAdded recipes for Item Teleporter, Obsidian Anchor, and Anchor Essence.\n\nAdded support for Item Teleports to the Rune Stone.",
    "1.6.1": "Fixed a chunk-loading-related issue",
    "1.6.2": "Fixed an issue where Obsidian Anchors dropped when any block was broken."
  },
  "1.18.2": {
    "1.0.0": "Added Portal Gate block\n\nAdded Rune Stone\n\nAdded Rune Stone modes\n\nAdded Portal Gate delay time\n\nAdded settings to enable or disable monsters using the portal\n\nAdded settings to enable or disable creatures using the portal\n\nAdded support for custom dimensions\n\nAdded unique textures for each block\n\nAdded Portal Gate Slab block\n\nAdded Portal Gate Slab Crystal block\n\nAdded Portal Gate Stair block\n\nAdded support for connected portal gate blocks to be removed when the portal is broken\n\nAdded support to change the delay time for the portal gate",
    "1.0.1": "Changed the default delay time for portal gates to 100 ticks 5 seconds\n\nChanged Portal Gate Steps, Portal Gate Slabs, and Portal Gate Slab Crystals to be breakable\n\nChanged Portal Gate Steps, Portal Gate Slabs, Portal Gate Slab Crystals now have a hardness of 5\n\nChanged Portal Gate Steps, Portal Gate Slabs, Portal Gate Slab Crystals now have pickaxes as the tool to mine\n\nChanged Portal Gate Slab Crystals to have glass-breaking sounds\n\nFixed issue where Portal Gate Steps, Portal Gate Slabs, and Portal Gate Slab Crystals could trap players\n\nFixed issue where Portal Gate Steps, Portal Gate Slabs, and Portal Gate Slab Crystals could not be placed in Creative mode\n\nFixed issue with Rune Stone item not properly setting default values when pulled from the creative inventory or summoned\n\nThe Portal Gate block will now check if Portal Gate Steps, Portal Gate Slabs, or Portal Gate Slab Crystals exists and then remove them when broken\n\nPortal Gate blocks can now only be placed if the 8 blocks around it support breaking using the tag portal_gates:replaceable_blocks\n\nPortal Gate Steps, Portal Gate Slabs, and Portal Gate Slab Crystals are all now grouped under the tag portal_gates:portal_gate_blocks\n\nThe tag portal_gates:replaceable_blocks supports the following blocks: Air, Water, Lava, Snow Layers, Fire, Saplings, Flowers, Double Flowers, Grasses, Double Grasses, Shrubs, Mushrooms, Fungus, Sweet Berries, Vine, Cave Vines, Nether Vines, Lily Pads, Kelp, Sea Grass, Structure Voids, Coral, Dead Coral, Roots, Nether Roots, Spores, Nether Sprouts",
    "1.1.0": "Added 10 advancements\n\nAdded all portal blocks to the mod creative tab\n\nAdded custom advancement background\n\nAdded mod creative tab\n\nAdded teleportation countdown timer Text\n\nCapped the minimum delay time to 200 ticks or 10s\n\nDefault delay time is now 200 ticks 10s\n\nDelay time may be a bit more stable now\n\nDelay time runs via entity not block now\n\nFixed issue with slabs and steps regarding AI pathfinding\n\nMade the portal gate block recipe more expensive\n\nMajor overhaul to the delay time script\n\nRecipe items now use tags for cross-mod support\n\nRemoved old portal_gate:solids block tag\n\nUpdated the modification display name",
    "1.2.0": "Added 16 colors for portal gate crystal particles\n\nAdded 16 colors for portal gate teleport particles\n\nAdded 16 teleportation particle colors and 32 particle elements\n\nAdded portal gate crystal particles\n\nAdded portal gate teleport particles swirl and single\n\nAdded support to dye Portal Gates\n\nAdded support to dye Portal Gate Crystals\n\nAdded teleportation particles to entities that are teleporting\n\nFixed issue where portal gates with different delays would swap delays\n\nFixed issue where unlinked portal gates would show countdown\n\nUpdated NBT Tag Names",
    "1.3.0": "Added cross-mod support tags for Portal Gate blocks\n\nAdded cross-mod support tags for Portal Gate Crystal blocks\n\nAdded cross-mod support tags for Portal Gate Slab blocks\n\nAdded cross-mod support tags for Portal Gate Steps blocks\n\nAdded cross-mod support tags for Rune Stone items\n\nAdded cross-mod support for some forge tags\n\nAdded cross-mod support throughout all the procedures\n\nAdded some custom forge tags\n\nChanged tag portal_gates:portal_gate_blocks to portal_gates:mechanics/portal_gate/removeable_blocks\n\nChanged tag portal_gates:replaceable_blocks to portal_gates:mechanics/replaceable_blocks\n\nChanged tags for recipes\n\nFixed a condition testing for any block rather than the portal gate default block\n\nRemoved the unused diamond block recipe tag\n\nRemoved unused tags"
  },
  "promos": {
    "1.19.2-latest": "1.6.2",
    "1.19.2-recommended": "1.6.2",
    "1.18.2-latest": "1.3.0",
    "1.18.2-recommended": "1.3.0"
  }
}
